
### :robot: Terraform Report
---
##### Plan: `1` to add, `2` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # kubectl_manifest.cloudflare_secret_token[0] will be updated in-place
  ~ resource "kubectl_manifest" "cloudflare_secret_token" {
        id                      = "/api/v1/namespaces/cert-manager/secrets/cloudflare-secret-token"
        name                    = "cloudflare-secret-token"
        # (15 unchanged attributes hidden)
    }

  # kubectl_manifest.gateway_ingress_dev[0] will be created
  + resource "kubectl_manifest" "gateway_ingress_dev" {
      + api_version             = "networking.istio.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Gateway"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "innovatshub-dev"
      + namespace               = "istio-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.istio.io/v1
            kind: Gateway
            metadata:
              name: innovatshub-dev
              namespace: istio-system
            spec:
              selector:
                istio: gateway
              servers:
              - hosts:
                - '*.dev.innovatshub.com'
                port:
                  name: http
                  number: 80
                  protocol: HTTP
                tls:
                  httpsRedirect: true
              - hosts:
                - '*.dev.innovatshub.com'
                port:
                  name: https
                  number: 443
                  protocol: HTTPS
                tls:
                  credentialName: wildcard-dev-innovatshub-com-tls
                  mode: SIMPLE
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.letsencrypt_cloudflare[0] will be updated in-place
  ~ resource "kubectl_manifest" "letsencrypt_cloudflare" {
        id                      = "/apis/cert-manager.io/v1/clusterissuers/letsencrypt-cloudflare"
        name                    = "letsencrypt-cloudflare"
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11543273508`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11543273508) - commit 472a2b89023b1f31b783529282796ba4a748272a
